{
  "backend/main.mo": "Defines the main actor for the HeartCanvas app with CRUD operations for HeartNote records (add, edit, delete, get, list) and a personal greeting message, using a Map for storage and migration support.",
  "backend/migration.mo": "Defines the migration module for the backend actor state, currently a no-op passthrough that returns the existing state unchanged.",
  "feature_evidence.json": "Feature evidence report linking the fix for disappearing heart notes after Version 7 deployment to the file `frontend/src/hooks/useQueries.ts` with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component's purpose and key implementation details.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes the full page layout including header, hero banner, greeting, heart canvas, and add-note form, with error and loading state handling for the heart notes query.",
  "frontend/src/components/AddHeartForm.tsx": "Collapsible form component for creating new heart notes with message/creator inputs, validation, error display, and a success animation on confirmed submission.",
  "frontend/src/components/AdminGreetingEditor.tsx": "Collapsible admin UI component for editing the site's personal greeting message, with pre-filled textarea, character counter, and save/success states.",
  "frontend/src/components/EditNoteModal.tsx": "A modal dialog component for editing an existing HeartNote's message, using the useEditHeartNote mutation hook and displaying a textarea with a 300-character limit.",
  "frontend/src/components/FloatingPetals.tsx": "A decorative background component that renders 18 randomly positioned animated floating heart/petal SVGs using memoized random values.",
  "frontend/src/components/HeartCanvas.tsx": "An interactive canvas component that displays draggable heart icons at percentage-based positions, supporting click-to-open note cards and drag-to-reposition with backend persistence.",
  "frontend/src/components/NoteCard.tsx": "A popover card component that displays a HeartNote's message, creator, and date with edit/delete actions, and positions itself relative to its parent heart icon with viewport-aware clamping.",
  "frontend/src/components/PersonalGreeting.tsx": "Displays a personalized greeting message fetched via usePersonalGreeting, falling back to a default message, with a decorative heart-and-line header/footer.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on heart notes (get all, add, edit, delete, update position) and personal greeting (get, update), each using the ICP actor from useActor and invalidating the relevant query cache on mutation success.",
  "frontend/src/index.css": "Global stylesheet importing Playfair Display and Lato fonts, defining Tailwind base/component/utility layers, a romantic rose/cream CSS variable palette for light and dark modes, and custom keyframe animations (floating petals, heart pulse, sparkle, shimmer, etc.).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider (TanStack Query) and InternetIdentityProvider wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom serif/sans fonts, an oklch-based rose/cream color palette mapped to CSS variables, custom shadows, border radii, and keyframe animations; includes typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata (version 3) for the 'Someone Special' app, recording a known issue of hearts disappearing after Version 7 deployment and a pending action request to verify and restore backend heart note CRUD functionality."
}