{
  "backend/main.mo": "Motoko actor defining the HeartNote data type and CRUD operations (add, edit, delete, get, list) for heart notes stored in a Map, plus a personal greeting message with get/update functions.",
  "feature_evidence.json": "Feature evidence report linking two implemented features—drag-and-drop heart repositioning on HeartCanvas and the useUpdateHeartPosition mutation hook—to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the project's component and hook structure.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "Minimal HTML entry point titled 'Someone Special' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component composing the full page layout including header, hero banner, PersonalGreeting, HeartCanvas, AddHeartForm, AdminGreetingEditor, and ambient decorative elements.",
  "frontend/src/components/AddHeartForm.tsx": "Collapsible form component for creating new heart notes with message and optional creator fields, inline validation, loading state, and a success animation on completion.",
  "frontend/src/components/AdminGreetingEditor.tsx": "Collapsible admin panel for reading and updating the site's personal greeting message, with a pre-filled textarea, character counter, and save/success states.",
  "frontend/src/components/EditNoteModal.tsx": "A modal dialog component for editing an existing HeartNote's message, using the useEditHeartNote mutation hook and displaying a textarea with a 300-character limit.",
  "frontend/src/components/FloatingPetals.tsx": "A decorative background component that renders 18 randomly positioned animated floating heart/petal SVGs using memoized random values.",
  "frontend/src/components/HeartCanvas.tsx": "An interactive canvas component that displays draggable heart note icons at percentage-based positions, supporting click-to-open note cards and drag-to-reposition with backend persistence.",
  "frontend/src/components/NoteCard.tsx": "A popover card component that displays a HeartNote's message, creator, and date with edit/delete actions, and positions itself relative to its parent heart icon with viewport-aware layout.",
  "frontend/src/components/PersonalGreeting.tsx": "Displays a personalized greeting message fetched via usePersonalGreeting, falling back to a default welcome message, styled with decorative heart dividers.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and persisted identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on heart notes and personal greeting, including fetching all notes, adding, editing, deleting, updating position, and managing the greeting message via the IC actor.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and Tailwind directives, defining CSS custom properties for a romantic rose/cream color palette (light and dark modes), and declaring keyframe animations for hearts, petals, and UI effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fonts, oklch-based color tokens (rose, cream, sidebar), border radii, box shadows, and keyframe animations for the romantic UI.",
  "project_state.json": "Project state metadata describing the 'Someone Special' canvas app built on the Internet Computer, tracking existing features (drag-and-drop hearts, position mutation hook) and pending feature requests (updatePosition backend function)."
}