{
  "kind": "build_request",
  "title": "Fix missing hearts after Version 7 deployment",
  "projectName": "Someone Special",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Investigate and fix the issue causing all heart notes to disappear from the HeartCanvas after the Version 7 deployment. Ensure that previously stored heart notes are correctly fetched from the backend and rendered on the canvas.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "my hearts are gone"
        ]
      },
      "acceptanceCriteria": [
        "All previously created heart notes are visible on the HeartCanvas after page load.",
        "The useQueries hook correctly fetches and returns the list of heart notes from the backend actor.",
        "No console errors related to heart note fetching or rendering.",
        "Newly added heart notes appear on the canvas immediately after creation.",
        "Heart notes persist across page refreshes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify that the backend's heart note list and CRUD functions (add, get, list, edit, delete) are functioning correctly and returning data as expected. If the Version 7 deployment introduced any state loss or schema change, restore or migrate the data appropriately.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "my hearts are gone"
        ]
      },
      "acceptanceCriteria": [
        "The backend `list` function returns all stored heart notes without error.",
        "Calling `add` creates a new heart note that is subsequently returned by `list`.",
        "The backend stable state is intact and no heart note data has been lost due to upgrade issues."
      ]
    }
  ],
  "constraints": [
    "Do not change the HeartNote data type schema unless required to fix the regression.",
    "Do not modify files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding new features to the heart notes system.",
    "Redesigning the HeartCanvas UI.",
    "Changing authentication or identity logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}