{
  "kind": "build_request",
  "title": "Add drag-to-reposition hearts on the canvas",
  "projectName": "Someone Special",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a drag-and-drop interaction to each heart icon on the HeartCanvas so users can click and drag a heart to reposition it anywhere on the canvas. While dragging, the heart should follow the cursor smoothly. On drop, the new position (as percentage coordinates relative to the canvas) must be persisted to the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a option so that i can move the hearts around to my desired location"
        ]
      },
      "acceptanceCriteria": [
        "Each heart on the canvas can be dragged by clicking and holding it.",
        "While dragging, the heart visually follows the mouse cursor.",
        "Dropping the heart anywhere on the canvas updates its position.",
        "The new position is saved to the backend (x/y as percentages of canvas dimensions) so it persists after page refresh.",
        "Clicking a heart (without dragging) still opens its NoteCard popup as before.",
        "All existing heart functionality (add, edit, delete, NoteCard popup) remains unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an `updatePosition` backend function to the HeartNote actor that accepts a note ID and new x/y percentage coordinates and updates the stored position for that note.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "move the hearts around to my desired location"
        ]
      },
      "acceptanceCriteria": [
        "A new `updatePosition(id: Text, x: Float, y: Float)` (or equivalent) function exists in backend/main.mo.",
        "Calling it with a valid ID updates the x/y coordinates of that HeartNote in the Map.",
        "Calling it with an invalid ID returns an appropriate error/null."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a `useUpdateHeartPosition` mutation hook in useQueries.ts that calls the backend `updatePosition` function and invalidates the heart notes query on success.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "move the hearts around to my desired location"
        ]
      },
      "acceptanceCriteria": [
        "A `useUpdateHeartPosition` mutation hook is defined and exported from useQueries.ts.",
        "On success it invalidates the heartNotes query cache so the canvas re-renders with updated positions.",
        "The hook is used by HeartCanvas to persist positions after a drag-and-drop."
      ]
    }
  ],
  "constraints": [
    "Do not change any existing functionality — heart add, edit, delete, NoteCard popup, personal greeting, admin editor, floating petals, and all visual styles must remain exactly as in Version 6.",
    "Do not edit any files under frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Heart positions must be stored as percentages (not pixels) so layout is responsive."
  ],
  "nonGoals": [
    "Reordering hearts by any means other than drag-and-drop.",
    "Locking or pinning hearts in place.",
    "Multi-select or group dragging of hearts.",
    "Any visual redesign or theme changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}