{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix missing hearts after Version 7 deployment",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Investigate and fix the issue causing all heart notes to disappear from the HeartCanvas after the Version 7 deployment. Ensure that previously stored heart notes are correctly fetched from the backend and rendered on the canvas.",
      "acceptanceCriteria": [
        "All previously created heart notes are visible on the HeartCanvas after page load.",
        "The useQueries hook correctly fetches and returns the list of heart notes from the backend actor.",
        "No console errors related to heart note fetching or rendering.",
        "Newly added heart notes appear on the canvas immediately after creation.",
        "Heart notes persist across page refreshes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useAllHeartNotes query hook to ensure it correctly calls the backend's getAllHeartNotes method and handles the response properly. Verify that the query key, enabled condition, and actor dependency are correctly configured to trigger fetching when the actor is available. Add error handling and logging to diagnose any fetch failures."
        },
        {
          "path": "frontend/src/components/HeartCanvas.tsx",
          "operation": "modify",
          "description": "Verify that the HeartCanvas component correctly consumes the useAllHeartNotes hook data and renders all heart notes on the canvas. Ensure that the loading state is properly handled and that heart notes are displayed as soon as data is available. Add console logging to verify that heart note data is being received and mapped correctly to the UI. Confirm that position values are correctly interpreted as percentage-based coordinates."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Verify that the useActor hook correctly initializes and returns the backend actor instance. Ensure that the actor is created with the correct canister ID and that any authentication state changes properly trigger actor recreation. Add logging to confirm actor initialization and verify that the actor methods are callable."
        },
        {
          "path": "frontend/src/components/AddHeartForm.tsx",
          "operation": "modify",
          "description": "Ensure that the AddHeartForm component uses the correct mutation hook for adding heart notes and that successful additions trigger a query invalidation to refresh the displayed hearts list. Verify that the position parameter passed to addHeartNote matches the expected [number, number] tuple format and that all required parameters (id, creator, message, timestamp, position) are provided correctly."
        }
      ]
    }
  ]
}