{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix unreadable note messages at the bottom of the site",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Fix text visibility and contrast for NoteCard popups displayed at the bottom of the site to ensure clear readability against backgrounds in all canvas positions",
      "acceptanceCriteria": [
        "NoteCard popup text (message, creator, date) is clearly readable regardless of its vertical position on the page",
        "Text contrast meets a minimum ratio of 4.5:1 against the card background",
        "NoteCard background has sufficient opacity or solid fill so underlying decorative elements do not bleed through and reduce readability",
        "The fix applies consistently for all heart notes whether they appear near the top, middle, or bottom of the canvas"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NoteCard.tsx",
          "operation": "modify",
          "description": "Improve text contrast and background opacity for the NoteCard component. Ensure the card background is fully opaque or has a solid fill to prevent decorative elements from bleeding through. Apply text color overrides with sufficient contrast (minimum 4.5:1 ratio) so message text, creator name, and date are clearly readable. Preserve the romantic styling while enhancing legibility for cards positioned anywhere on the canvas, especially near the bottom where the issue was reported."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add or adjust CSS custom properties and utility classes to support improved text contrast for note cards. Define high-contrast text color tokens if needed and ensure background color tokens provide sufficient opacity. Keep the romantic rose/blush/cream palette intact while ensuring readability standards are met across all theme modes."
        }
      ]
    }
  ]
}